Revit 2024 API
PartMakerMethodToDivideVolumes.GetOffsetForIntersectingReference Method
 Gets offset for the intersecting reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double GetOffsetForIntersectingReference(
	ElementId intersectingReference
)
Visual Basic
Public Function GetOffsetForIntersectingReference ( _
	intersectingReference As ElementId _
) As Double
Visual C++
public:
double GetOffsetForIntersectingReference(
	ElementId^ intersectingReference
)
Parameters
intersectingReference
Type: Autodesk.Revit.DB.ElementId
 The intersecting reference to obtain offset value from.
Return Value
 The offset for the intersecting reference
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  PartMaker does not use the specified intersecting reference.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace